{
  "festivals": [
    {
      "id": "fest001",
      "name": "Diwali",
      "category": "hindu_festival_pan_india",
      "region_specific": "All India",
      "recommended_persona_id": "pers004",
      "quick_version": "Festival of Lights celebrating Ram's return to Ayodhya, Lakshmi worship.",
      "states_celebrated": ["All states and union territories"],
      "main_locations": ["Varanasi, Ayodhya, Jaipur, Amritsar, Mumbai, Delhi"],
      "typical_months": ["October-November (Kartik month)"],
      "description": "Festival of Lights celebrating victory of light over darkness. Homes lit with diyas, rangoli decorations, fireworks, family gatherings, sweets exchange.",
      "mythological_background": "Celebrates Lord Rama's return to Ayodhya after 14 years exile and victory over Ravana. Also marks Goddess Lakshmi worship for prosperity.",
      "crowd_impact": "Extremely high across all cities. Hotels, trains, flights book months advance.",
      "travel_tips": "Book accommodation 2-3 months advance. Prepare for firecracker noise and pollution. Varanasi and Ayodhya offer spectacular traditional celebrations.",
      "usual_weather": "Pleasant autumn weather, 15-25°C",
      "recommended_experiences": "Ganga Aarti in Varanasi, Ram Lila in Ayodhya, Golden Temple illumination, traditional markets",
      "avoid_common_mistake": "Don't expect shops open on actual Diwali day - most closed. Visit 2-3 days before for markets.",
      "related_sites": ["sp009", "sp012", "sp019"]
    },
    {
      "id": "fest002",
      "name": "Holi",
      "category": "hindu_festival_spring",
      "region_specific": "North India primarily",
      "recommended_persona_id": "pers001",
      "quick_version": "Festival of Colors celebrating spring, Krishna-Radha divine play.",
      "states_celebrated": ["All India, especially North India"],
      "main_locations": ["Mathura, Vrindavan, Barsana, Delhi, Jaipur, Varanasi"],
      "typical_months": ["March (Phalguna month)"],
      "description": "Festival of Colors celebrating spring, love, triumph of good over evil. Colored powders (gulal), water balloons, music, dance, thandai, gujiya.",
      "mythological_background": "Celebrates burning of demoness Holika and salvation of Prahlad. In Vrindavan-Mathura, celebrates divine love of Radha-Krishna.",
      "crowd_impact": "Very high in Mathura-Vrindavan. Lathmar Holi in Barsana draws massive crowds. Streets become playgrounds.",
      "travel_tips": "Wear old white clothes you can discard. Organic colors safer. Mathura-Vrindavan celebrations week-long. Book months ahead. Apply oil before for easy color removal.",
      "usual_weather": "Pleasant spring, 20-30°C",
      "recommended_experiences": "Lathmar Holi in Barsana, Banke Bihari Temple Vrindavan, Widow's Holi, traditional thandai",
      "avoid_common_mistake": "Don't wear contact lenses - colored powder damages them. Protect cameras in waterproof bags.",
      "related_sites": ["sp018"]
    },
    {
      "id": "fest003",
      "name": "Durga Puja",
      "category": "hindu_festival_regional",
      "region_specific": "Eastern India",
      "recommended_persona_id": "pers004",
      "quick_version": "Bengal's grandest festival with artistic pandals celebrating Durga's victory.",
      "states_celebrated": ["West Bengal, Assam, Odisha, Tripura, Bihar"],
      "main_locations": ["Kolkata, Cuttack, Guwahati, Patna"],
      "typical_months": ["September-October (Ashwin month)"],
      "description": "Grandest Bengal festival celebrating Goddess Durga's victory over demon Mahishasura. Elaborate pandals, artistic idols, cultural programs, street food, immersion procession.",
      "mythological_background": "Goddess Durga battles buffalo demon Mahishasura for nine nights, achieves victory on tenth day (Vijayadashami). Celebrates triumph of good over evil.",
      "crowd_impact": "Kolkata transforms with thousands of pandals. Massive crowds especially Ashtami and Navami. Pandal-hopping creates street congestion.",
      "travel_tips": "Kolkata metro crowded but efficient. Comfortable walking shoes essential. Book hotels 3-4 months advance. Start pandal visits post-midnight for smaller crowds.",
      "usual_weather": "Post-monsoon pleasant, 25-32°C",
      "recommended_experiences": "Theme-based pandal artistry, Kumartuli idol-making, Dhunuchi dance, Sindoor Khela, Bengali food, Visarjan procession",
      "avoid_common_mistake": "Don't try visiting all famous pandals - lines 3-4 hours long. Select 10-15 pandals strategically.",
      "related_sites": ["sp010", "sp050"]
    },
    {
      "id": "fest004",
      "name": "Ganesh Chaturthi",
      "category": "hindu_festival_regional",
      "region_specific": "Western and Southern India",
      "recommended_persona_id": "pers001",
      "quick_version": "Ganesha's birthday with clay idols and spectacular immersions.",
      "states_celebrated": ["Maharashtra, Karnataka, Goa, Andhra Pradesh, Telangana"],
      "main_locations": ["Mumbai, Pune, Hyderabad, Bengaluru, Goa"],
      "typical_months": ["August-September (Bhadrapada month)"],
      "description": "Celebrates birth of Lord Ganesha. Clay idol installation in homes and public pandals, daily worship 1.5-11 days, cultural programs, processions, final immersion (Visarjan).",
      "mythological_background": "Celebrates birthday of Lord Ganesha, remover of obstacles. Son of Shiva and Parvati, created by Parvati from turmeric paste.",
      "crowd_impact": "Mumbai experiences massive crowds during final immersion. Lalbaugcha Raja pandal has 24+ hour queues. Streets elaborately decorated.",
      "travel_tips": "Lalbaugcha Raja - either first day or paid Mukh Darshan. Final immersion day (Anant Chaturdashi) spectacular but maximum crowds. Modak (sweet) is signature prasad.",
      "usual_weather": "Monsoon tail-end, 25-30°C, possibility of rain",
      "recommended_experiences": "Lalbaugcha Raja darshan Mumbai, Dagdusheth Ganpati Pune, Khairatabad Ganesh Hyderabad, immersion processions, modak tasting",
      "avoid_common_mistake": "Lalbaugcha Raja Mukh Darshan sold out - book online immediately. Free darshan queue is 24+ hours.",
      "estimated_time_saved": "Mukh Darshan saves 20-22 hours"
    },
    {
      "id": "fest005",
      "name": "Pushkar Camel Fair",
      "category": "cultural_fair",
      "region_specific": "Rajasthan",
      "recommended_persona_id": "pers001",
      "quick_version": "World's largest camel fair with cultural events and Kartik Purnima bath.",
      "states_celebrated": ["Rajasthan"],
      "main_locations": ["Pushkar"],
      "typical_months": ["October-November (Kartik month)"],
      "description": "World's largest camel fair combined with religious pilgrimage. Cattle trading, cultural events, camel races, folk performances, hot air balloons, spiritual bathing during Kartik Purnima.",
      "mythological_background": "Pushkar Lake created from Brahma's lotus petals. Kartik Purnima (full moon) bath considered highly auspicious. Fair timing coincides with sacred bath.",
      "crowd_impact": "Pushkar swells from 20,000 to 200,000+. Desert camping sites fill up. Final two days (religious phase) most crowded.",
      "travel_tips": "Book 3-4 months advance. Two phases - camel trading (first 5 days, less crowded) and religious (final 3 days, very crowded). Carry sunscreen, light cotton clothes.",
      "usual_weather": "Pleasant desert winter, 10-27°C, dry",
      "recommended_experiences": "Camel safari, hot air balloon rides, folk dance, mustache competitions, bridal competitions, Brahma Temple, Kartik Purnima holy bath",
      "avoid_common_mistake": "Don't book only for religious days - camel trading phase has authentic rural experience with fewer crowds.",
      "related_sites": ["sp020"]
    },
    {
      "id": "fest006",
      "name": "Kumbh Mela",
      "category": "pilgrimage_mega_event",
      "region_specific": "Rotating four cities",
      "recommended_persona_id": "pers002",
      "quick_version": "World's largest religious gathering, rotates among four cities every 3 years.",
      "states_celebrated": ["Rotating: Uttar Pradesh, Uttarakhand, Madhya Pradesh, Maharashtra"],
      "main_locations": ["Prayagraj, Haridwar, Nashik, Ujjain"],
      "typical_months": ["Rotates every 3 years, Maha Kumbh every 12 years"],
      "description": "World's largest religious gathering with 100+ million participants over 45-55 days. Sadhus, pilgrims take holy dip at river confluence on auspicious dates. Spiritual discourses, cultural events, temporary tent city.",
      "mythological_background": "During Samudra Manthan (cosmic ocean churning), drops of nectar (amrit) fell at four locations. Bathing on specific astrological dates grants moksha.",
      "crowd_impact": "Unimaginably massive crowds on Shahi Snan (royal bath) days. World's largest temporary human settlement. UNESCO Intangible Cultural Heritage.",
      "travel_tips": "Attend Ardh Kumbh (6 years) or Kumbh (3 years) for manageable crowds. Government arranges tent accommodations. Avoid Shahi Snan days unless prepared for extreme crowds.",
      "usual_weather": "Varies by location, winter Kumbhs can be cold (5-20°C)",
      "recommended_experiences": "Naga Sadhu processions, Shahi Snan on auspicious dates, spiritual discourses, meeting saints, confluence bath, evening aarti",
      "avoid_common_mistake": "Don't go only on main Shahi Snan days - stampede risk. Visit 3-4 days before/after for spiritual experience with manageable crowds.",
      "related_sites": ["sp016", "sp007", "sp021"]
    },
    {
      "id": "fest007",
      "name": "Onam",
      "category": "harvest_festival",
      "region_specific": "Kerala",
      "recommended_persona_id": "pers001",
      "quick_version": "Kerala's harvest festival with flower carpets, boat races, grand feast.",
      "states_celebrated": ["Kerala"],
      "main_locations": ["Thrissur, Kochi, Thiruvananthapuram, Kottayam"],
      "typical_months": ["August-September (Chingam month)"],
      "description": "Kerala's harvest festival celebrating ten-day homecoming of mythical King Mahabali. Flower carpets (Pookalam), Vallam Kali (snake boat races), Onasadya (grand feast), traditional dance, new clothes.",
      "mythological_background": "Celebrates annual visit of beloved King Mahabali from netherworld. Vishnu's Vamana avatar pushed Mahabali to netherworld but granted annual return.",
      "crowd_impact": "Moderate to high in cities. Snake boat races attract large crowds. Backwaters houseboats book months ahead.",
      "travel_tips": "Experience Onam Sadya (26+ dish feast on banana leaf) - reservations needed. Attend Nehru Trophy Boat Race or Aranmula Boat Race. Book houseboats advance.",
      "usual_weather": "Monsoon tail-end, humid, 24-30°C, occasional rain",
      "recommended_experiences": "Onasadya feast, snake boat races, Pookalam competitions, Pulikali tiger dance, Kathakali performances, Kaikottikali dance",
      "avoid_common_mistake": "Onasadya must be eaten in specific order on banana leaf. Local guides explain traditional method. Don't mix all items at once."
    },
    {
      "id": "fest008",
      "name": "Rath Yatra",
      "category": "chariot_festival",
      "region_specific": "Odisha primarily",
      "recommended_persona_id": "pers002",
      "quick_version": "Massive chariot festival of Lord Jagannath in Puri, millions participate.",
      "states_celebrated": ["Odisha, also Ahmedabad and other cities"],
      "main_locations": ["Puri, Ahmedabad"],
      "typical_months": ["June-July (Ashadha month)"],
      "description": "Annual chariot festival where Lord Jagannath, Balabhadra, Subhadra taken out in three massive chariots from main temple to Gundicha Temple. Millions pull chariots through Grand Road.",
      "mythological_background": "Celebrates Lord Jagannath's annual visit to aunt's temple (Gundicha Temple). Deities travel in chariots and stay 7 days before returning. Pulling ropes considered meritorious.",
      "crowd_impact": "World's largest religious processions with 1+ million in Puri. Entire 3 km Grand Road packed. Accommodations fully booked months ahead.",
      "travel_tips": "Book accommodation 4-6 months advance. Arrive 2-3 days early. Stake out spot early morning. Security tight. Carry water, snacks, sunscreen. Pulling ropes auspicious but requires proximity.",
      "usual_weather": "Hot and humid monsoon onset, 28-35°C, possible rain",
      "recommended_experiences": "Pulling chariot ropes, Pahandi (deity procession), 3 km chariot journey, Gundicha Temple visit, Bahuda Yatra (return), Suna Besha",
      "avoid_common_mistake": "Don't try to be at front near chariots - stampede risk. Viewing from rooftops equally auspicious and safer.",
      "related_sites": ["sp003"]
    },
    {
      "id": "fest009",
      "name": "Hemis Festival",
      "category": "buddhist_festival",
      "region_specific": "Ladakh",
      "recommended_persona_id": "pers004",
      "quick_version": "Ladakh's colorful Buddhist festival with masked Cham dances.",
      "states_celebrated": ["Ladakh"],
      "main_locations": ["Hemis Monastery"],
      "typical_months": ["June-July"],
      "description": "Colorful Buddhist festival celebrating birth anniversary of Guru Padmasambhava. Masked Cham dance performances depicting victory of good over evil. Every 12 years, large Thangka unveiled.",
      "mythological_background": "Commemorates Guru Padmasambhava who brought Buddhism to Tibet and Himalayan regions in 8th century. Masked dances represent Buddhist deities and demons.",
      "crowd_impact": "Moderate. Popular with international tourists. Hemis Monastery courtyard can be crowded but manageable.",
      "travel_tips": "Acclimatize in Leh 2-3 days before visiting (3,500m altitude). Book Leh accommodation advance. Day trip from Leh (45 km). Carry warm layers even in summer.",
      "usual_weather": "Pleasant summer high-altitude, 15-25°C daytime, cold nights",
      "recommended_experiences": "Cham masked dances, traditional Ladakhi costumes, monastery architecture, handicrafts market, traditional food",
      "avoid_common_mistake": "Altitude sickness real risk - acclimatize in Leh properly. Many rush from arrival and face health issues."
    },
    {
      "id": "fest010",
      "name": "Navratri & Dussehra",
      "category": "hindu_festival_pan_india",
      "region_specific": "All India with regional variations",
      "recommended_persona_id": "pers002",
      "quick_version": "Nine nights of Goddess worship, Garba in Gujarat, culminates in Dussehra.",
      "states_celebrated": ["All India with regional variations"],
      "main_locations": ["Gujarat (Garba), Kolkata (Durga Puja), Mysuru (Dasara), Kullu, Varanasi"],
      "typical_months": ["September-October (Ashwin month)"],
      "description": "Nine-night festival worshipping Goddess Durga. Gujarat famous for Garba and Dandiya. Culminates on 10th day as Vijayadashami/Dussehra celebrating Ram's victory over Ravana with effigy burning.",
      "mythological_background": "Celebrates Goddess Durga's nine-night battle with demon Mahishasura. Also commemorates Lord Rama's victory over Ravana. Nine forms of Durga worshipped each night.",
      "crowd_impact": "Gujarat Garba grounds very crowded. Mysuru Dasara procession attracts 500,000+. Kullu Dussehra massive hill state gathering.",
      "travel_tips": "Gujarat - attend Garba/Dandiya in traditional attire. Mysuru - book months ahead for Dasara procession. Kullu - unique hill festival. Fasting common during nine days.",
      "usual_weather": "Pleasant post-monsoon, 22-30°C",
      "recommended_experiences": "Garba-Dandiya in Gujarat, Mysuru Palace illumination and Dasara procession, Kullu Dussehra deity fair, Ramlila performances, Ravana effigy burning",
      "avoid_common_mistake": "In Gujarat, don't wear jeans to Garba - traditional attire preferred. Many venues enforce dress code.",
      "related_sites": ["sp019"]
    },
    {
      "id": "fest011",
      "name": "Maha Shivaratri",
      "category": "hindu_festival_shiva",
      "region_specific": "All India",
      "recommended_persona_id": "pers002",
      "quick_version": "Great night of Shiva, all-night vigil, Jyotirlinga darshan most auspicious.",
      "states_celebrated": ["All India, especially at Shiva temples"],
      "main_locations": ["Varanasi, Haridwar, Ujjain, Kedarnath, all Jyotirlingas"],
      "typical_months": ["February-March (Phalguna/Magha month)"],
      "description": "Most auspicious night for Lord Shiva worship. Devotees observe all-night vigil, fasting, chanting Om Namah Shivaya, offering bel leaves, milk, honey to Shiva lingam.",
      "mythological_background": "Night when Shiva performed Tandava (cosmic dance). Also celebrated as wedding night of Shiva and Parvati. Staying awake all night worshipping Shiva grants liberation.",
      "crowd_impact": "Massive crowds at all Shiva temples, especially Jyotirlingas and Varanasi. Kashi Vishwanath, Mahakaleshwar, Somnath see 10x normal crowds. All-night festivities.",
      "travel_tips": "Book accommodation 2-3 months advance. Prepare for all-night stay. Carry warm clothes (February nights cold). Bel leaves offered. Queue times 5-8 hours at major temples.",
      "usual_weather": "Cool to cold night, 10-20°C",
      "recommended_experiences": "All-night vigil at Kashi Vishwanath, Ganga Aarti Varanasi, Bhasma Aarti Mahakaleshwar Ujjain, Jyotirlinga darshan, continuous abhishekams",
      "avoid_common_mistake": "Don't plan to sleep - celebrations all night. Come prepared for night-long queue and darshan.",
      "related_sites": ["sp009", "sp007", "sp006", "sp005", "sp008"]
    },
    {
      "id": "fest012",
      "name": "Janmashtami",
      "category": "hindu_festival_krishna",
      "region_specific": "All India, especially Krishna sites",
      "recommended_persona_id": "pers002",
      "quick_version": "Krishna's birthday celebration, midnight abhishek, Dahi Handi in Maharashtra.",
      "states_celebrated": ["All India, especially Mathura, Vrindavan, Maharashtra"],
      "main_locations": ["Mathura, Vrindavan, Mumbai, Delhi, Dwarka"],
      "typical_months": ["August-September (Bhadrapada month)"],
      "description": "Celebrates birth of Lord Krishna at midnight. Fasting until midnight, singing bhajans, performing Krishna leelas, decorating cradles, Dahi Handi (human pyramids) in Maharashtra.",
      "mythological_background": "Krishna born at midnight in Mathura prison to Devaki and Vasudeva, 8th avatar of Vishnu. Born to kill demon king Kansa. Celebrations replicate birth night events.",
      "crowd_impact": "Mathura-Vrindavan extremely crowded, especially Krishnajanmabhoomi Temple. Mumbai's Dahi Handi events draw massive crowds. Temples open all night.",
      "travel_tips": "Mathura-Vrindavan book 2-3 months ahead. Midnight abhishek most important - arrive early evening. Dwarka also celebrates grandly. Mumbai's Dahi Handi next day. Fasting until midnight traditional.",
      "usual_weather": "Monsoon season, 25-30°C, possibility of rain",
      "recommended_experiences": "Midnight abhishek at Krishnajanmabhoomi Mathura, Banke Bihari Temple Vrindavan, Dahi Handi Mumbai, Krishna jhankis, bhajan-kirtan",
      "avoid_common_mistake": "Birth ceremony at midnight - don't arrive morning. Previous night to midnight is key time period.",
      "related_sites": ["sp018", "sp002"]
    },
    {
      "id": "fest013",
      "name": "Pongal",
      "category": "harvest_festival",
      "region_specific": "Tamil Nadu",
      "recommended_persona_id": "pers001",
      "quick_version": "Tamil harvest festival, four days, sun worship, jallikattu bull racing.",
      "states_celebrated": ["Tamil Nadu, also Puducherry, Andhra Pradesh"],
      "main_locations": ["Chennai, Madurai, Coimbatore, rural Tamil Nadu"],
      "typical_months": ["January (Thai month)"],
      "description": "Four-day Tamil harvest festival. First day Bhogi (discarding old), second Thai Pongal (sun worship), third Mattu Pongal (cattle worship), fourth Kaanum Pongal (socializing). Traditional sweet rice dish (pongal) cooked outdoors.",
      "mythological_background": "Thanks Sun God for good harvest. Mattu Pongal honors cattle crucial for agriculture. Jallikattu bull taming sport controversy. Symbolizes prosperity and new beginnings.",
      "crowd_impact": "Moderate. Mostly family celebrations. Jallikattu events in Madurai region draw large crowds.",
      "travel_tips": "Experience rural Tamil Nadu for authentic celebrations. Try traditional pongal sweet rice. Witness Kolam (rangoli) competitions. Jallikattu controversial - be aware.",
      "usual_weather": "Pleasant winter, 20-28°C",
      "recommended_experiences": "Outdoor pongal cooking, kolam decorations, cattle decoration, jallikattu (if interested), traditional Tamil feast",
      "avoid_common_mistake": "Jallikattu is controversial animal sport - not for everyone. Tamil Nadu celebrates as cultural tradition.",
      "related_sites": ["sp014"]
    },
    {
      "id": "fest014",
      "name": "Gangaur Festival",
      "category": "regional_festival",
      "region_specific": "Rajasthan",
      "recommended_persona_id": "pers001",
      "quick_version": "Rajasthan women's festival worshipping Gauri (Parvati), colorful processions.",
      "states_celebrated": ["Rajasthan"],
      "main_locations": ["Jaipur, Udaipur, Jodhpur"],
      "typical_months": ["March-April (Chaitra month)"],
      "description": "18-day festival primarily for women worshipping Gauri (Parvati). Married women pray for husband's long life, unmarried for good husband. Colorful processions with decorated idols, traditional attire, folk songs.",
      "mythological_background": "Celebrates Gauri's (Parvati's) reunion with Shiva. Gauri means fair and represents marital bliss. Women fast and perform rituals for family welfare.",
      "crowd_impact": "Moderate. Processions in Jaipur and Udaipur attract good crowds. Mostly cultural and community event.",
      "travel_tips": "Best experienced in Jaipur or Udaipur. Women in traditional colorful attire. Photography of processions allowed. Combine with regular sightseeing.",
      "usual_weather": "Spring weather warming up, 25-35°C",
      "recommended_experiences": "Women's processions, traditional Rajasthani attire, folk songs, Gauri idol decorations",
      "avoid_common_mistake": "Primarily women's festival - male tourists respectful observation. Not a major tourist event."
    }
  ]
}
