{
  "cuisines": [
    {
      "id": "cuis001",
      "state": "Punjab",
      "region_specific": "North India",
      "category": "north_indian_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Mustard greens with cornmeal flatbread, iconic Punjabi winter delicacy.",
      "dish_name": "Sarson Da Saag with Makki Di Roti",
      "veg_or_nonveg": "Vegetarian",
      "description": "Mustard greens cooked with spices served with cornmeal flatbread topped with white butter. Iconic Punjabi winter delicacy rich in flavor and nutrition.",
      "when_to_try": "Best during winter months (November-February) when mustard greens fresh",
      "recommended_places_generic": "Amritsar dhabas, roadside eateries, authentic Punjabi restaurants, Golden Temple langar",
      "avoid_common_mistake": "Only fresh in winter. Summer versions use frozen saag lacking authentic taste. Visit Punjab in winter.",
      "related_sites": ["sp012"]
    },
    {
      "id": "cuis002",
      "state": "Kerala",
      "region_specific": "South India",
      "category": "south_indian_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Fermented rice pancakes with coconut milk stew, Kerala breakfast staple.",
      "dish_name": "Appam with Stew",
      "veg_or_nonveg": "Both varieties",
      "description": "Fermented rice pancakes with soft center and crispy edges, served with coconut milk-based vegetable or meat stew. Breakfast staple.",
      "when_to_try": "Year-round breakfast dish, especially good during monsoon",
      "recommended_places_generic": "Kochi restaurants, Alleppey houseboats, traditional Kerala homes, coastal eateries",
      "avoid_common_mistake": "Appam freshly made tastes best. Buffet pre-made appam becomes hard. Order fresh from kitchen."
    },
    {
      "id": "cuis003",
      "state": "Rajasthan",
      "region_specific": "North India",
      "category": "north_indian_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Baked wheat balls with lentils and sweet crumble, Rajasthan's signature dish.",
      "dish_name": "Dal Baati Churma",
      "veg_or_nonveg": "Vegetarian",
      "description": "Baked wheat balls (baati) served with mixed lentil curry (dal) and sweetened crumbled wheat (churma). Represents desert cuisine's heartiness.",
      "when_to_try": "Year-round, especially during festivals and weddings",
      "recommended_places_generic": "Jaipur traditional restaurants, Jodhpur local eateries, heritage hotels, village tourism experiences",
      "avoid_common_mistake": "Authentic baati is hard - must be dunked in ghee and dal to soften. Don't eat dry thinking it's bad quality.",
      "related_sites": ["sp020"]
    },
    {
      "id": "cuis004",
      "state": "West Bengal",
      "region_specific": "East India",
      "category": "east_indian_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Light fish curry with turmeric base, Bengali comfort food with rice.",
      "dish_name": "Macher Jhol",
      "veg_or_nonveg": "Non-Vegetarian",
      "description": "Light fish curry with potatoes in turmeric-based gravy. Bengali comfort food highlighting freshwater fish like rohu or katla.",
      "when_to_try": "Year-round, especially during monsoon when fish abundant",
      "recommended_places_generic": "Kolkata home-style restaurants, Bengal fish markets with eateries, Sundarbans region",
      "avoid_common_mistake": "Freshwater fish (rohu, katla, hilsa) is authentic. Tourists often get sea fish substitutes. Ask for traditional freshwater fish.",
      "related_sites": ["sp050"]
    },
    {
      "id": "cuis005",
      "state": "Tamil Nadu",
      "region_specific": "South India",
      "category": "south_indian_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Intensely spicy chicken curry with freshly ground Chettinad spices.",
      "dish_name": "Chettinad Chicken",
      "veg_or_nonveg": "Non-Vegetarian",
      "description": "Spicy chicken curry from Chettinad region using freshly ground spices, coconut, curry leaves. Known for intense heat and complex flavor.",
      "when_to_try": "Year-round, pairs well with dosa, rice, or parotta",
      "recommended_places_generic": "Chettinad restaurants in Chennai, Karaikudi specialty eateries, Tamil Nadu traditional hotels",
      "avoid_common_mistake": "Genuinely spicy - not for show. Request 'medium spicy' if low tolerance. Indian 'spicy' can be overwhelming.",
      "related_sites": ["sp014"]
    },
    {
      "id": "cuis006",
      "state": "Maharashtra",
      "region_specific": "West India",
      "category": "street_food",
      "recommended_persona_id": "pers001",
      "quick_version": "Mumbai's iconic spiced potato fritter in bread bun, 'Indian burger'.",
      "dish_name": "Vada Pav",
      "veg_or_nonveg": "Vegetarian",
      "description": "Mumbai's iconic street food - spiced mashed potato fritter (vada) in bread bun (pav) with chutneys. Often called 'Indian burger'.",
      "when_to_try": "Year-round street food, especially good during monsoon",
      "recommended_places_generic": "Mumbai street stalls, Dadar vendors, Churchgate area, local railway stations",
      "avoid_common_mistake": "Best from street vendors, not fancy restaurants. Authentic vada pav costs ₹15-30. Expensive mall versions aren't authentic.",
      "related_sites": ["sp015"]
    },
    {
      "id": "cuis007",
      "state": "Goa",
      "region_specific": "West India",
      "category": "coastal_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Tangy coconut-based fish curry with kokum, Portuguese-Indian fusion.",
      "dish_name": "Goan Fish Curry",
      "veg_or_nonveg": "Non-Vegetarian",
      "description": "Tangy, spicy fish curry made with coconut, kokum, local spices. Portuguese-Indian fusion reflecting Goan coastal cuisine.",
      "when_to_try": "Year-round, monsoon brings fresh catch",
      "recommended_places_generic": "Beach shacks, Goan home-style restaurants, Panjim eateries, coastal villages",
      "avoid_common_mistake": "Should have tanginess from kokum/tamarind. If too creamy and mild, adapted for tourist palates. Ask for authentic spicy version."
    },
    {
      "id": "cuis008",
      "state": "Gujarat",
      "region_specific": "West India",
      "category": "gujarati_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Steamed fermented gram flour cake, light and healthy Gujarati snack.",
      "dish_name": "Dhokla",
      "veg_or_nonveg": "Vegetarian",
      "description": "Steamed fermented gram flour cake, light and fluffy, tempered with mustard seeds and curry leaves. Healthy breakfast or snack.",
      "when_to_try": "Year-round breakfast and snack, especially popular during festivals",
      "recommended_places_generic": "Ahmedabad street vendors, Gujarat farsan shops, breakfast eateries, traditional restaurants",
      "avoid_common_mistake": "Should be soft and spongy. If dense and hard, it's old or poorly made. Fresh dhokla is key."
    },
    {
      "id": "cuis009",
      "state": "Assam",
      "region_specific": "Northeast India",
      "category": "northeast_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Tangy fish curry using tomatoes or elephant apple for sourness.",
      "dish_name": "Masor Tenga",
      "veg_or_nonveg": "Non-Vegetarian",
      "description": "Tangy fish curry using tomatoes, lemon, or elephant apple for sourness. Light, healthy preparation typical of Assamese cuisine.",
      "when_to_try": "Summer months for refreshing sour taste, year-round availability",
      "recommended_places_generic": "Guwahati local restaurants, Assamese home-style eateries, Brahmaputra riverfront cafes",
      "avoid_common_mistake": "Tenga means sour - if not tangy, not authentic. Should have pronounced sour taste.",
      "related_sites": ["sp010"]
    },
    {
      "id": "cuis010",
      "state": "Kashmir",
      "region_specific": "North India",
      "category": "kashmiri_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Aromatic lamb curry with rich red gravy, signature Wazwan dish.",
      "dish_name": "Rogan Josh",
      "veg_or_nonveg": "Non-Vegetarian",
      "description": "Aromatic lamb curry with rich red gravy made using Kashmiri chilies, yogurt, traditional spices. Signature dish of Wazwan feast.",
      "when_to_try": "Year-round, especially during winter and traditional Wazwan feasts",
      "recommended_places_generic": "Srinagar traditional restaurants, Wazwan specialists, Dal Lake houseboats, Kashmiri Pandit homes",
      "avoid_common_mistake": "Authentic uses Kashmiri chili for color, not heat. If extremely spicy, not traditional. Should be flavorful but mildly spicy."
    },
    {
      "id": "cuis011",
      "state": "Andhra Pradesh",
      "region_specific": "South India",
      "category": "biryani",
      "recommended_persona_id": "pers001",
      "quick_version": "World-famous layered rice with meat in dum style, Hyderabad's crown jewel.",
      "dish_name": "Hyderabadi Biryani",
      "veg_or_nonveg": "Non-Vegetarian (Veg versions available)",
      "description": "World-famous layered rice dish with marinated meat, saffron, aromatic spices cooked in 'dum' style. Blends Mughal and Telugu influences.",
      "when_to_try": "Year-round, Sunday family meals traditional",
      "recommended_places_generic": "Hyderabad's Paradise, Bawarchi, Shah Ghouse, Old City biryani houses",
      "avoid_common_mistake": "Authentic has layers - rice and meat cooked separately then layered and dum-cooked. If mixed like pulao, not authentic.",
      "related_sites": ["sp011"]
    },
    {
      "id": "cuis012",
      "state": "Himachal Pradesh",
      "region_specific": "North India",
      "category": "himachali_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Steamed wheat bread stuffed with walnut or poppy seeds, Himachali specialty.",
      "dish_name": "Siddu",
      "veg_or_nonveg": "Vegetarian",
      "description": "Steamed wheat bread stuffed with walnut or poppy seed paste. Traditional Himachali dish served with ghee or dal.",
      "when_to_try": "Winter specialty, available year-round in traditional homes and restaurants",
      "recommended_places_generic": "Manali local dhabas, Shimla traditional restaurants, Himachali homestays, mountain villages",
      "avoid_common_mistake": "Should be eaten hot with ghee. Cold siddu becomes hard. Order fresh and eat immediately."
    },
    {
      "id": "cuis013",
      "state": "Odisha",
      "region_specific": "East India",
      "category": "odia_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Rice and lentil pancakes cooked in earthen pots, Odia breakfast specialty.",
      "dish_name": "Poda Pitha",
      "veg_or_nonveg": "Vegetarian",
      "description": "Fermented rice and black gram pancake cooked slowly in earthen pots. Sweet caramelized flavor from slow cooking. Odia specialty.",
      "when_to_try": "Winter and festival times, especially Raja Parba and Manabasa Gurubara",
      "recommended_places_generic": "Bhubaneswar traditional eateries, Puri local homes, Odia sweet shops, temple prasad counters",
      "avoid_common_mistake": "Authentic poda pitha cooked in earthen pot overnight. Modern versions lack caramelized flavor. Seek traditional preparation.",
      "related_sites": ["sp003"]
    },
    {
      "id": "cuis014",
      "state": "Bihar",
      "region_specific": "East India",
      "category": "bihari_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Roasted wheat balls with mashed vegetables, Bihari signature dish.",
      "dish_name": "Litti Chokha",
      "veg_or_nonveg": "Vegetarian",
      "description": "Roasted wheat flour balls stuffed with sattu (roasted gram flour) served with mashed vegetables (chokha) - potato, eggplant, tomato. Bihar's signature dish.",
      "when_to_try": "Year-round, especially during winter months",
      "recommended_places_generic": "Patna street vendors, Bihari dhabas, traditional homes, roadside stalls",
      "avoid_common_mistake": "Litti should be roasted over charcoal for smoky flavor, not baked in oven. Charcoal roasting makes it authentic.",
      "related_sites": ["sp039"]
    },
    {
      "id": "cuis015",
      "state": "Karnataka",
      "region_specific": "South India",
      "category": "karnataka_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Rice and lentil dumplings steamed in jackfruit leaves, Mangalorean specialty.",
      "dish_name": "Neer Dosa with Kori Rotti",
      "veg_or_nonveg": "Non-Vegetarian",
      "description": "Thin rice crepes (neer dosa) served with spicy chicken curry and crispy rice wafers (rotti). Mangalorean coastal specialty.",
      "when_to_try": "Year-round breakfast or dinner",
      "recommended_places_generic": "Mangalore restaurants, Udupi traditional eateries, coastal Karnataka homes",
      "avoid_common_mistake": "Neer dosa should be very thin and soft. Thick versions aren't authentic. Made without fermentation unlike regular dosa.",
      "related_sites": ["sp032"]
    },
    {
      "id": "cuis016",
      "state": "Madhya Pradesh",
      "region_specific": "Central India",
      "category": "madhya_pradesh_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Grated corn cooked in milk with spices, Indore street food specialty.",
      "dish_name": "Bhutte Ka Kees",
      "veg_or_nonveg": "Vegetarian",
      "description": "Grated corn cooked in milk with spices and garnished with coriander, lemon. Indore's famous street food, creamy and flavorful.",
      "when_to_try": "Monsoon and post-monsoon (July-October) when corn is fresh",
      "recommended_places_generic": "Indore street stalls, Sarafa Bazaar night market, local eateries",
      "avoid_common_mistake": "Best with fresh tender corn during monsoon season. Off-season versions lack sweetness and texture.",
      "related_sites": ["sp007", "sp008"]
    },
    {
      "id": "cuis017",
      "state": "Meghalaya",
      "region_specific": "Northeast India",
      "category": "northeast_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Pork with fermented bamboo shoots, signature Khasi tribal dish.",
      "dish_name": "Jadoh",
      "veg_or_nonveg": "Non-Vegetarian",
      "description": "Rice cooked with pork, black sesame, and local spices. Sometimes includes pig blood. Khasi tribal specialty representing Meghalaya cuisine.",
      "when_to_try": "Year-round, especially during tribal festivals",
      "recommended_places_generic": "Shillong local eateries, Khasi tribal homes, Cherrapunji homestays, Police Bazaar restaurants",
      "avoid_common_mistake": "Authentic versions use pig blood which some find off-putting. Specify if you prefer without blood. Flavor is rich and earthy."
    },
    {
      "id": "cuis018",
      "state": "Nagaland",
      "region_specific": "Northeast India",
      "category": "northeast_cuisine",
      "recommended_persona_id": "pers001",
      "quick_version": "Smoked pork with fermented bamboo shoot and naga chili, extremely spicy.",
      "dish_name": "Smoked Pork with Akhuni",
      "veg_or_nonveg": "Non-Vegetarian",
      "description": "Smoked pork cooked with akhuni (fermented soybean) and raja mircha (bhut jolokia - ghost pepper). Intensely spicy and flavorful Naga cuisine.",
      "when_to_try": "Year-round, Hornbill Festival (December) best time",
      "recommended_places_generic": "Kohima local eateries, tribal homestays, Hornbill Festival food stalls",
      "avoid_common_mistake": "Bhut jolokia is world's hottest chili. Request less spicy version if needed. Akhuni has strong fermented smell - acquired taste."
    }
  ]
}
