{
  "shlokas": [
    {
      "id": "shl001",
      "category": "peace",
      "recommended_persona_id": "pers002",
      "quick_version": "Universal peace prayer for wellbeing of all beings.",
      "sanskrit": "ॐ सर्वेषां स्वस्तिर्भवतु। सर्वेषां शान्तिर्भवतु। सर्वेषां पूर्णं भवतु। सर्वेषां मङ्गलं भवतु।",
      "transliteration": "Om Sarveṣāṃ Svastir Bhavatu, Sarveṣāṃ Śāntir Bhavatu, Sarveṣāṃ Pūrṇaṃ Bhavatu, Sarveṣāṃ Maṅgalaṃ Bhavatu",
      "meaning_english": "May auspiciousness be unto all, May peace be unto all, May fullness be unto all, May prosperity be unto all.",
      "meaning_hindi": "सबका कल्याण हो, सबको शांति मिले, सबको परिपूर्णता मिले, सबका मंगल हो।",
      "use_context": "Universal peace prayer, ideal for beginning or ending spiritual practices, meditation, or seeking collective wellbeing.",
      "avoid_common_mistake": "Don't rush through this mantra - each line should be chanted with feeling and intention. Many chant mechanically without understanding meaning."
    },
    {
      "id": "shl002",
      "category": "courage",
      "recommended_persona_id": "pers002",
      "quick_version": "Ancient Upanishadic prayer for enlightenment and truth.",
      "sanskrit": "ॐ असतो मा सद्गमय। तमसो मा ज्योतिर्गमय। मृत्योर्मा अमृतं गमय।",
      "transliteration": "Om Asato Mā Sad-Gamaya, Tamaso Mā Jyotir-Gamaya, Mṛtyor-Mā Amṛtaṃ Gamaya",
      "meaning_english": "Lead me from untruth to truth, Lead me from darkness to light, Lead me from death to immortality.",
      "meaning_hindi": "मुझे असत्य से सत्य की ओर ले चलो, अंधकार से प्रकाश की ओर ले चलो, मृत्यु से अमरता की ओर ले चलो।",
      "use_context": "Pavamana Mantra from Brihadaranyaka Upanishad. Chant when facing difficult journeys, seeking spiritual guidance, or beginning new endeavors requiring courage.",
      "avoid_common_mistake": "This is a prayer for guidance, not magical protection. Combine with sincere effort and action."
    },
    {
      "id": "shl003",
      "category": "protection",
      "recommended_persona_id": "pers002",
      "quick_version": "Mahamrityunjaya Mantra - most powerful Shiva protection chant.",
      "sanskrit": "ॐ त्र्यम्बकं यजामहे सुगन्धिं पुष्टिवर्धनम्। उर्वारुकमिव बन्धनान्मृत्योर्मुक्षीय माऽमृतात्।",
      "transliteration": "Om Tryambakaṃ Yajāmahe Sugandhiṃ Puṣṭi-Vardhanam, Urvārukam-Iva Bandhanān Mṛtyor-Mukṣīya Mā-'mṛtāt",
      "meaning_english": "We worship the three-eyed One (Lord Shiva) who is fragrant and nourishes all beings. May He liberate us from death for the sake of immortality, just as a ripe cucumber is severed from its bondage to the vine.",
      "meaning_hindi": "हम त्रिनेत्रधारी भगवान शिव की पूजा करते हैं जो सुगंधित और सभी को पोषित करते हैं। वे हमें मृत्यु के बंधन से मुक्त करें, जैसे पका हुआ खीरा बेल से अलग हो जाता है।",
      "use_context": "Mahamrityunjaya Mantra - powerful protection chant before dangerous journeys, treks, for healing and overcoming fear of death. Chant during difficult situations.",
      "avoid_common_mistake": "Pronunciation matters - 'Tryambakam' not 'Triambakam'. Learn correct pronunciation from guru or audio source. Chant 108 times for maximum effect."
    },
    {
      "id": "shl004",
      "category": "devotion",
      "recommended_persona_id": "pers002",
      "quick_version": "Panchakshari - five-syllable Shiva mantra, simple yet profound.",
      "sanskrit": "ॐ नमः शिवाय",
      "transliteration": "Om Namaḥ Śivāya",
      "meaning_english": "I bow to Lord Shiva - the auspicious one, the supreme reality.",
      "meaning_hindi": "मैं भगवान शिव को नमन करता हूं - शुभ और परम सत्य को।",
      "use_context": "Panchakshari Mantra - five-syllable mantra of Lord Shiva. Chant when visiting Jyotirlingas, during meditation, or seeking inner transformation. Simple yet profoundly powerful.",
      "avoid_common_mistake": "Don't underestimate its simplicity. This five-syllable mantra is considered as powerful as longer mantras. Consistency matters more than duration."
    },
    {
      "id": "shl005",
      "category": "devotion",
      "recommended_persona_id": "pers002",
      "quick_version": "Dvadasakshari - twelve-syllable Vishnu/Krishna mantra.",
      "sanskrit": "ॐ नमो भगवते वासुदेवाय",
      "transliteration": "Om Namo Bhagavate Vāsudevāya",
      "meaning_english": "I bow to Lord Vasudeva (Krishna/Vishnu), the Supreme Divine residing in all beings.",
      "meaning_hindi": "मैं भगवान वासुदेव (कृष्ण/विष्णु) को नमन करता हूं, जो सभी प्राणियों में निवास करते हैं।",
      "use_context": "Dvadasakshari Mantra for Lord Vishnu. Chant when visiting Vishnu temples like Badrinath, Dwarka, Puri, Tirupati. Invokes divine protection and grace.",
      "avoid_common_mistake": "Chant with devotion, not as mechanical repetition. Understanding Vasudeva as omnipresent enhances practice.",
      "related_sites": ["sp001", "sp002", "sp003", "sp011"]
    },
    {
      "id": "shl006",
      "category": "gratitude",
      "recommended_persona_id": "pers002",
      "quick_version": "Compassion mantra for universal happiness and freedom.",
      "sanskrit": "लोकाः समस्ताः सुखिनो भवन्तु",
      "transliteration": "Lokāḥ Samastāḥ Sukhino Bhavantu",
      "meaning_english": "May all beings in all worlds be happy and free.",
      "meaning_hindi": "सभी लोकों के सभी प्राणी सुखी और मुक्त हों।",
      "use_context": "Compassion mantra expressing gratitude and universal wellbeing. Chant after completing pilgrimages, meditation, or as expression of thankfulness.",
      "avoid_common_mistake": "This isn't just for ending prayers - it's a profound wish for all beings. Cultivate genuine feeling of universal compassion while chanting."
    },
    {
      "id": "shl007",
      "category": "inner_strength",
      "recommended_persona_id": "pers002",
      "quick_version": "Patanjali's definition of yoga - stilling the mind.",
      "sanskrit": "योगः चित्तवृत्ति निरोधः",
      "transliteration": "Yogaḥ Citta-Vṛtti Nirodhaḥ",
      "meaning_english": "Yoga is the cessation of the fluctuations of the mind.",
      "meaning_hindi": "योग मन की वृत्तियों का निरोध है।",
      "use_context": "From Patanjali's Yoga Sutras. Reflect on this before yoga practice, meditation, or when seeking mental clarity and inner peace.",
      "avoid_common_mistake": "This isn't about forcing mind to stop - it's about understanding mind's nature. Many misinterpret as suppression rather than transcendence."
    },
    {
      "id": "shl008",
      "category": "courage",
      "recommended_persona_id": "pers002",
      "quick_version": "Bhagavad Gita teaching on karma yoga - duty without attachment.",
      "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि।",
      "transliteration": "Karmaṇy-evādhikāras-te Mā Phaleṣu Kadācana, Mā Karma-phala-hetur-bhūr-mā Te Saṅgo-'stv-akarmaṇi",
      "meaning_english": "You have the right to perform your duty, but not to the fruits thereof. Never consider yourself the cause of results, nor be attached to inaction.",
      "meaning_hindi": "तुम्हें केवल कर्म करने का अधिकार है, फल का नहीं। कभी अपने को कर्मफल का कारण मत समझो और न ही कर्म न करने में आसक्त होओ।",
      "use_context": "Bhagavad Gita Chapter 2, Verse 47. Reflect before challenging treks, difficult journeys, or when facing obstacles. Teaches detachment from results.",
      "avoid_common_mistake": "Doesn't mean don't care about outcomes - means don't be anxious about results. Do your best, accept what comes."
    },
    {
      "id": "shl009",
      "category": "peace",
      "recommended_persona_id": "pers002",
      "quick_version": "Triple peace invocation for body, mind, and environment.",
      "sanskrit": "ॐ शान्तिः शान्तिः शान्तिः",
      "transliteration": "Om Śāntiḥ Śāntiḥ Śāntiḥ",
      "meaning_english": "Om Peace, Peace, Peace. (Peace in body, peace in mind, peace in environment)",
      "meaning_hindi": "ॐ शांति, शांति, शांति। (शरीर में शांति, मन में शांति, वातावरण में शांति)",
      "use_context": "Shanti Mantra - three repetitions represent peace from physical, mental/emotional, and environmental disturbances. Chant to conclude prayers, meditation, or create peaceful atmosphere.",
      "avoid_common_mistake": "Three repetitions are meaningful - physical (Adhibhautika), mental (Adhidaivika), spiritual (Adhyatmika) peace. Don't skip or rush."
    },
    {
      "id": "shl010",
      "category": "devotion",
      "recommended_persona_id": "pers002",
      "quick_version": "Navarna Mantra - nine-syllable Durga/Chamunda protection mantra.",
      "sanskrit": "ॐ ऐं ह्रीं क्लीं चामुण्डायै विच्चे",
      "transliteration": "Om Aiṃ Hrīṃ Klīṃ Cāmuṇḍāyai Vicce",
      "meaning_english": "Salutations to Goddess Chamunda, the slayer of demons. Om represents knowledge, prosperity, and power.",
      "meaning_hindi": "देवी चामुंडा को नमस्कार, जो राक्षसों का संहार करती हैं। ॐ ज्ञान, समृद्धि और शक्ति का प्रतीक है।",
      "use_context": "Navarna Mantra of Goddess Durga/Chamunda. Chant when visiting Shaktipeethas, during Navratri, or seeking divine feminine energy and protection.",
      "avoid_common_mistake": "Pronunciation of bija mantras (Aim, Hreem, Kleem) important - learn from authentic source before chanting.",
      "related_sites": ["sp010"]
    },
    {
      "id": "shl011",
      "category": "inner_strength",
      "recommended_persona_id": "pers002",
      "quick_version": "Mahavakya - 'You are That' teaching oneness with divine.",
      "sanskrit": "तत्त्वमसि",
      "transliteration": "Tat Tvam Asi",
      "meaning_english": "Thou Art That - You are the ultimate reality, the divine consciousness.",
      "meaning_hindi": "तुम वही हो - तुम परम सत्य हो, दिव्य चेतना हो।",
      "use_context": "Mahavakya from Chandogya Upanishad. Meditate on this profound teaching recognizing one's true divine nature. Use during deep introspection or spiritual seeking.",
      "avoid_common_mistake": "This isn't ego affirmation - it's recognition of Atman (soul) and Brahman (universal consciousness) being same. Requires contemplation."
    },
    {
      "id": "shl012",
      "category": "protection",
      "recommended_persona_id": "pers001",
      "quick_version": "Ganesha mantra for removing obstacles before journeys.",
      "sanskrit": "ॐ गं गणपतये नमः",
      "transliteration": "Om Gaṃ Gaṇapataye Namaḥ",
      "meaning_english": "I bow to Lord Ganesha, the remover of obstacles.",
      "meaning_hindi": "मैं भगवान गणेश को नमन करता हूं, जो विघ्नों को दूर करते हैं।",
      "use_context": "Ganesha mantra - chant before beginning any journey, pilgrimage, new venture, or when facing obstacles. Invoke blessings for smooth travels.",
      "avoid_common_mistake": "Chant before starting journey, not during problems. Ganesha removes obstacles when invoked at beginning. 108 repetitions traditional."
    },
    {
      "id": "shl013",
      "category": "devotion",
      "recommended_persona_id": "pers002",
      "quick_version": "Gayatri Mantra - most sacred Vedic mantra for enlightenment.",
      "sanskrit": "ॐ भूर्भुवः स्वः तत्सवितुर्वरेण्यं भर्गो देवस्य धीमहि धियो यो नः प्रचोदयात्",
      "transliteration": "Om Bhūr Bhuvaḥ Svaḥ, Tat Savitur Vareṇyaṃ, Bhargo Devasya Dhīmahi, Dhiyo Yo Naḥ Prachodayāt",
      "meaning_english": "We meditate on the glory of the Creator who has created the Universe, who is worthy of worship, who is the embodiment of knowledge and light. May He enlighten our intellect.",
      "meaning_hindi": "हम उस सृष्टिकर्ता की महिमा का ध्यान करते हैं जिसने ब्रह्मांड की रचना की है, जो पूजनीय है, जो ज्ञान और प्रकाश का अवतार है। वह हमारी बुद्धि को प्रकाशित करे।",
      "use_context": "Most sacred Vedic mantra. Chant during sunrise (Sandhya) for spiritual enlightenment, mental clarity, and divine wisdom. Foundation of Vedic spiritual practice.",
      "avoid_common_mistake": "Traditionally chanted during sunrise, noon, and sunset. Learning correct pronunciation crucial - seek proper initiation. Not to be chanted casually."
    },
    {
      "id": "shl014",
      "category": "travel_protection",
      "recommended_persona_id": "pers003",
      "quick_version": "Hanuman Chalisa opening verse for protection during travels.",
      "sanskrit": "श्रीगुरु चरन सरोज रज, निजमन मुकुरु सुधारि। बरनउं रघुबर बिमल जसु, जो दायकु फल चारि।",
      "transliteration": "Śrī Guru Carana Saroja Raja, Nija Mana Mukuru Sudhāri, Baranaū Raghubara Bimala Jasu, Jo Dāyaku Phala Cāri",
      "meaning_english": "With the dust of my Guru's lotus feet, I cleanse the mirror of my mind. I describe the pure glory of Lord Rama, which bestows the four fruits of life.",
      "meaning_hindi": "श्री गुरु के चरण कमल की धूलि से अपने मन रूपी दर्पण को स्वच्छ करके, मैं श्री रघुवीर के निर्मल यश का वर्णन करता हूं जो चारों फल देने वाला है।",
      "use_context": "Opening verse of Hanuman Chalisa. Recite before treks, challenging journeys, or when needing Hanuman's protection and strength. Full Chalisa reading takes 10 minutes.",
      "avoid_common_mistake": "Many chant only this verse - full Hanuman Chalisa has 40 verses and is complete protection prayer. Chant full Chalisa for maximum benefit."
    },
    {
      "id": "shl015",
      "category": "morning_prayer",
      "recommended_persona_id": "pers002",
      "quick_version": "Morning prayer to Mother Earth before stepping on ground.",
      "sanskrit": "समुद्रवसने देवि पर्वतस्तनमण्डले। विष्णुपत्नि नमस्तुभ्यं पादस्पर्शं क्षमस्वमे।",
      "transliteration": "Samudra-vasane Devi Parvata-stana-maṇḍale, Viṣṇu-patni Namas-tubhyaṃ Pāda-sparśaṃ Kṣamasva-me",
      "meaning_english": "O Mother Earth, who has oceans as garments and mountains as breasts, consort of Lord Vishnu, I bow to you. Please forgive me for touching you with my feet.",
      "meaning_hindi": "हे पृथ्वी माता, जिसके वस्त्र सागर हैं और पर्वत वक्षस्थल हैं, विष्णु की पत्नी, आपको नमस्कार। मुझे अपने चरणों से स्पर्श करने के लिए क्षमा करें।",
      "use_context": "Traditional morning prayer recited before stepping on ground after waking up. Shows respect to Mother Earth. Cultivates gratitude and humility.",
      "avoid_common_mistake": "Should be recited while still in bed before touching feet to ground. Many forget this beautiful morning practice."
    },
    {
      "id": "shl016",
      "category": "gratitude",
      "recommended_persona_id": "pers002",
      "quick_version": "Food blessing before meals - offering to divine.",
      "sanskrit": "ब्रह्मार्पणं ब्रह्म हविर्ब्रह्माग्नौ ब्रह्मणा हुतम्। ब्रह्मैव तेन गन्तव्यं ब्रह्मकर्मसमाधिना।",
      "transliteration": "Brahmārpaṇaṃ Brahma Havir-Brahmāgnau Brahmaṇā Hutam, Brahmaiva Tena Gantavyaṃ Brahma-karma-samādhinā",
      "meaning_english": "The act of offering is Brahman, the offering itself is Brahman, offered by Brahman into the fire of Brahman. Brahman alone is to be reached by one who sees Brahman in action.",
      "meaning_hindi": "अर्पण करने की क्रिया ब्रह्म है, अर्पण भी ब्रह्म है, ब्रह्म द्वारा ब्रह्म की अग्नि में अर्पित। ब्रह्म ही प्राप्त होता है उसे जो कर्म में ब्रह्म को देखता है।",
      "use_context": "Bhagavad Gita verse 4.24 - recite before meals to offer food to divine. Transforms eating into spiritual act. Cultivates mindful eating.",
      "avoid_common_mistake": "Not just mechanical recitation - pause and genuinely offer food mentally to divine before eating. Mindfulness is key."
    },
    {
      "id": "shl017",
      "category": "evening_prayer",
      "recommended_persona_id": "pers002",
      "quick_version": "Evening lamp lighting prayer invoking divine light.",
      "sanskrit": "दीपज्योति परब्रह्म दीपज्योति जनार्दनः। दीपो हरतु मे पापं दीपज्योतिर्नमोऽस्तु ते।",
      "transliteration": "Dīpa-jyoti Para-brahma Dīpa-jyoti Janārdanaḥ, Dīpo Haratu Me Pāpaṃ Dīpa-jyotir-namo-'stu Te",
      "meaning_english": "The light of the lamp is the Supreme Brahman, the light of the lamp is Vishnu. May the lamp remove my sins. Salutations to the light of the lamp.",
      "meaning_hindi": "दीपक की ज्योति परब्रह्म है, दीपक की ज्योति जनार्दन है। दीपक मेरे पापों को हरे। दीपक की ज्योति को नमस्कार।",
      "use_context": "Evening diya (lamp) lighting prayer. Chant when lighting lamps during evening worship or meditation. Symbolizes removing darkness of ignorance.",
      "avoid_common_mistake": "Light lamp with reverence, not mechanically. The act of lighting itself is worship - do mindfully."
    },
    {
      "id": "shl018",
      "category": "guru_devotion",
      "recommended_persona_id": "pers002",
      "quick_version": "Guru prayer - teacher as manifestation of divine trinity.",
      "sanskrit": "गुरुर्ब्रह्मा गुरुर्विष्णुः गुरुर्देवो महेश्वरः। गुरुः साक्षात् परं ब्रह्म तस्मै श्रीगुरवे नमः।",
      "transliteration": "Gurur-brahmā Gurur-viṣṇuḥ Gurur-devo Maheśvaraḥ, Guruḥ Sākṣāt Paraṃ Brahma Tasmai Śrī-gurave Namaḥ",
      "meaning_english": "The Guru is Brahma (creator), the Guru is Vishnu (preserver), the Guru is Shiva (destroyer). The Guru is verily the Supreme Brahman. Salutations to that Guru.",
      "meaning_hindi": "गुरु ब्रह्मा हैं, गुरु विष्णु हैं, गुरु देव महेश्वर हैं। गुरु साक्षात् परम ब्रह्म हैं। उन श्री गुरु को नमस्कार।",
      "use_context": "Guru Purnima or when expressing gratitude to teachers and spiritual guides. Acknowledges guru's role in spiritual awakening.",
      "avoid_common_mistake": "Guru not just academic teacher - represents one who removes darkness of ignorance. Spiritual guide deserving highest reverence."
    },
    {
      "id": "shl019",
      "category": "sleep_prayer",
      "recommended_persona_id": "pers002",
      "quick_version": "Night prayer before sleep - surrendering body and mind.",
      "sanskrit": "करचरणकृतं वाक्कायजं कर्मजं वा। श्रवणनयनजं वा मानसं वापराधम्। विहितमविहितं वा सर्वमेतत्क्षमस्व। जय जय करुणाब्धे श्रीमहादेव शम्भो।",
      "transliteration": "Kara-caraṇa-kṛtaṃ Vāk-kāya-jaṃ Karma-jaṃ Vā, Śravaṇa-nayana-jaṃ Vā Mānasaṃ Vā-aparādham, Vihitam-avihitaṃ Vā Sarvam-etat-kṣamasva, Jaya Jaya Karuṇā-abdhe Śrī-mahādeva Śambho",
      "meaning_english": "Whatever sins I committed through hands, feet, speech, body, actions, ears, eyes, or mind - consciously or unconsciously - please forgive all. Victory to you, ocean of compassion, Lord Shiva.",
      "meaning_hindi": "जो भी पाप मैंने हाथ, पैर, वाणी, शरीर, कर्म, कान, आँख या मन से किए - जानबूझकर या अनजाने में - सब क्षमा करें। जय हो, करुणा के सागर, महादेव शंभो।",
      "use_context": "Night prayer before sleep asking forgiveness for day's mistakes. Promotes self-reflection and peaceful sleep. Releases guilt and worry.",
      "avoid_common_mistake": "Not about cultivating guilt - about honest acknowledgment and release. Forgive yourself as you ask for forgiveness."
    }
  ]
}
