{
  "routines": [
    {
      "id": "well001",
      "name": "Morning Energizing Yoga Flow",
      "routine_type": "Yoga",
      "category": "energizing_practice",
      "recommended_persona_id": "pers002",
      "quick_version": "20-min morning yoga with Sun Salutations, warriors, for energy boost.",
      "target_mood": "Energy boost, alertness, vitality",
      "duration_minutes": 20,
      "difficulty": "Beginner",
      "effort_level": "Low to Moderate",
      "steps": [
        "Begin in Mountain Pose (Tadasana) - Stand tall, feet together, hands in prayer position. Take 5 deep breaths.",
        "Sun Salutation A (Surya Namaskar) - Complete 3 rounds slowly, coordinating breath with movement.",
        "Warrior II (Virabhadrasana II) - Hold 5 breaths each side. Strengthens legs, opens hips.",
        "Triangle Pose (Trikonasana) - Hold 5 breaths each side. Stretches sides, improves balance.",
        "Downward Facing Dog (Adho Mukha Svanasana) - Hold for 8 breaths. Energizes body, stretches spine.",
        "Cobra Pose (Bhujangasana) - Hold 5 breaths. Opens chest, strengthens back.",
        "Child's Pose (Balasana) - Rest for 8 breaths. Gentle hip and back stretch.",
        "Seated twist (Ardha Matsyendrasana) - 5 breaths each side. Spinal health, digestive aid.",
        "Final relaxation in Corpse Pose (Shavasana) - 2 minutes. Full body relaxation."
      ],
      "safety_notes": "Avoid if you have back injury. Consult doctor if pregnant. Don't overstretch. Listen to your body. Empty stomach preferred or 2 hours after light meal.",
      "optional_shloka_id": "shl007",
      "avoid_common_mistake": "Don't skip final Shavasana thinking it's waste of time. Those 2 minutes of integration are crucial for benefits. Many beginners rush through or skip it.",
      "related_sites": ["sp017"]
    },
    {
      "id": "well002",
      "name": "Stress Relief Meditation",
      "routine_type": "Meditation",
      "category": "stress_management",
      "recommended_persona_id": "pers002",
      "quick_version": "15-min meditation with body scan, breath awareness, and So Ham mantra.",
      "target_mood": "Stress reduction, calm, inner peace",
      "duration_minutes": 15,
      "difficulty": "Beginner",
      "effort_level": "Low - suitable for all",
      "steps": [
        "Find quiet space. Sit comfortably with spine straight (chair or floor with cushion).",
        "Close eyes gently. Place hands on knees in Gyan Mudra (thumb and index finger touching).",
        "Body scan: Mentally scan from toes to head, releasing tension from each body part (2 minutes).",
        "Observe natural breath without controlling it. Notice inhale and exhale rhythm (2 minutes).",
        "Practice 4-7-8 breathing: Inhale for 4 counts, hold for 7, exhale for 8. Repeat 5 cycles.",
        "Bring attention to space between eyebrows (Ajna chakra). Visualize peaceful blue light (3 minutes).",
        "Mental mantra: Silently repeat 'So Ham' (I am that). 'So' on inhale, 'Ham' on exhale (3 minutes).",
        "Gradually expand awareness to sounds around you, body sensations, then slowly open eyes.",
        "Sit quietly for a moment before resuming activities. Notice how you feel."
      ],
      "safety_notes": "No contraindications. Safe for all. If feel lightheaded during breath hold, skip that step. Practice regularly for best results. Morning or evening ideal times.",
      "optional_shloka_id": "shl009",
      "avoid_common_mistake": "Don't expect immediate results or perfectly quiet mind. Meditation is practice, not perfection. Thoughts will come - gently return to breath/mantra. Consistency matters more than duration.",
      "related_sites": ["sp017", "sp039"]
    },
    {
      "id": "well003",
      "name": "Evening Relaxation Routine",
      "routine_type": "Yoga",
      "category": "relaxation_sleep",
      "recommended_persona_id": "pers002",
      "quick_version": "25-min gentle evening yoga for relaxation and better sleep preparation.",
      "target_mood": "Relaxation, better sleep, stress release",
      "duration_minutes": 25,
      "difficulty": "Beginner",
      "effort_level": "Very Low - deeply relaxing",
      "steps": [
        "Gentle neck rolls and shoulder shrugs to release tension (2 minutes).",
        "Seated Forward Bend (Paschimottanasana) - Hold 10 breaths. Calms nervous system.",
        "Supine Spinal Twist (Supta Matsyendrasana) - 8 breaths each side. Releases back tension.",
        "Legs Up the Wall (Viparita Karani) - Hold 5 minutes. Reverses blood flow, deeply relaxing.",
        "Reclining Butterfly (Supta Baddha Konasana) - Hold 3 minutes. Opens hips, calms mind.",
        "Happy Baby Pose (Ananda Balasana) - Gently rock side to side for 2 minutes. Hip release.",
        "Corpse Pose (Shavasana) with guided body relaxation - 8 minutes. Systematically relax each body part.",
        "End with Bee Breath (Bhramari Pranayama) - 5 rounds. Humming sound calms nervous system.",
        "Conclude in comfortable seated position with gratitude prayer or affirmation."
      ],
      "safety_notes": "Perfect for evening before bed. Avoid inversions if you have eye pressure issues. Use props (bolsters, blankets) for comfort. Don't skip final relaxation. Dim lighting helps.",
      "optional_shloka_id": "shl006",
      "avoid_common_mistake": "Don't practice this routine if you need to stay alert - it's designed to prepare for sleep. Also, practice 1-2 hours after dinner, not immediately after eating.",
      "related_contexts": ["Better sleep", "Stress relief", "Evening routine"]
    },
    {
      "id": "well004",
      "name": "Core Strength Yoga Practice",
      "routine_type": "Yoga",
      "category": "strength_building",
      "recommended_persona_id": "pers002",
      "quick_version": "30-min intermediate yoga focusing on core strength with planks and boat pose.",
      "target_mood": "Strength building, confidence, determination",
      "duration_minutes": 30,
      "difficulty": "Intermediate",
      "effort_level": "High - strength focused",
      "steps": [
        "Warm-up with 5 rounds of Sun Salutation B (Surya Namaskar B).",
        "Plank Pose - Hold for 30 seconds, building to 1 minute. Core foundation.",
        "Boat Pose (Navasana) - Hold 5 breaths, release, repeat 3 times. Abdominal strength.",
        "Side Plank (Vasisthasana) - 30 seconds each side. Oblique strengthening.",
        "Crow Pose (Bakasana) - Arm balance working up to 10 breaths. Full core engagement.",
        "Dolphin Plank - Hold 45 seconds. Core and shoulder strength.",
        "Bridge Pose (Setu Bandhasana) - Hold 10 breaths, 2 rounds. Back body strengthening.",
        "Forearm Plank - Hold 45 seconds. Deep core activation.",
        "Low Lunge twists - 5 breaths each side, 2 rounds. Core strength with flexibility.",
        "Cool down in Child's Pose (2 minutes) and final Shavasana (3 minutes)."
      ],
      "safety_notes": "Not suitable for those with wrist, shoulder, or lower back injuries. Build up gradually. Engage core throughout to protect back. Breathe steadily - don't hold breath. Modify as needed.",
      "optional_shloka_id": "shl008",
      "avoid_common_mistake": "Don't sacrifice form for duration. Better to hold plank 20 seconds with perfect alignment than 1 minute with sagging hips. Core engagement is key.",
      "related_contexts": ["Strength training", "Core workout", "Trek preparation"]
    },
    {
      "id": "well005",
      "name": "Pranayama for Mental Clarity",
      "routine_type": "Breathing Exercises",
      "category": "mental_clarity",
      "recommended_persona_id": "pers002",
      "quick_version": "15-min advanced breathing techniques for focus and alertness.",
      "target_mood": "Mental clarity, focus, alertness",
      "duration_minutes": 15,
      "difficulty": "Intermediate",
      "effort_level": "Moderate - requires practice",
      "steps": [
        "Sit in comfortable cross-legged position. Spine erect, shoulders relaxed (1 minute settling).",
        "Kapalabhati (Skull Shining Breath) - Forceful exhales, passive inhales. 3 rounds of 30 strokes each.",
        "Rest for 1 minute in natural breathing between rounds. Observe sensations.",
        "Nadi Shodhana (Alternate Nostril Breathing) - Close right nostril, inhale left. Close left, exhale right. Continue alternating. 10 rounds.",
        "Bhastrika (Bellows Breath) - Equal forceful inhales and exhales. 2 rounds of 20 breaths. Energizing.",
        "Rest in natural breathing for 2 minutes. Notice increased mental clarity.",
        "Bhramari (Bee Breath) - Inhale deeply, exhale with humming sound. 7 rounds. Calms mind.",
        "Conclude with 3 minutes of silent observation of natural breath.",
        "Seal practice with Om chanting (3 times) and moment of gratitude."
      ],
      "safety_notes": "Avoid Kapalabhati and Bhastrika if pregnant, have heart issues, high blood pressure, or hernia. Practice on empty stomach. Don't force breath. If dizzy, return to normal breathing. Best practiced morning.",
      "optional_shloka_id": "shl002",
      "avoid_common_mistake": "Never practice powerful pranayama (Kapalabhati, Bhastrika) if you have high blood pressure, heart issues, or are pregnant. Learn from qualified teacher first - incorrect practice can be harmful.",
      "related_contexts": ["Mental focus", "Exam preparation", "Work productivity"]
    },
    {
      "id": "well006",
      "name": "Chakra Meditation Journey",
      "routine_type": "Meditation",
      "category": "energy_work",
      "recommended_persona_id": "pers002",
      "quick_version": "35-min chakra meditation journey through all seven energy centers.",
      "target_mood": "Energy balance, spiritual connection, holistic wellness",
      "duration_minutes": 35,
      "difficulty": "Intermediate",
      "effort_level": "Moderate - requires focus",
      "steps": [
        "Sit in meditation posture. Close eyes. Take 10 deep, cleansing breaths.",
        "Root Chakra (Muladhara) - Base of spine. Visualize red energy. Affirmation: 'I am grounded and safe.' (4 minutes)",
        "Sacral Chakra (Svadhisthana) - Below navel. Visualize orange energy. Affirmation: 'I embrace creativity and pleasure.' (4 minutes)",
        "Solar Plexus Chakra (Manipura) - Above navel. Visualize yellow energy. Affirmation: 'I am confident and powerful.' (4 minutes)",
        "Heart Chakra (Anahata) - Center of chest. Visualize green energy. Affirmation: 'I give and receive love freely.' (5 minutes)",
        "Throat Chakra (Vishuddha) - Throat. Visualize blue energy. Affirmation: 'I speak my truth clearly.' (4 minutes)",
        "Third Eye Chakra (Ajna) - Between eyebrows. Visualize indigo energy. Affirmation: 'I trust my intuition.' (5 minutes)",
        "Crown Chakra (Sahasrara) - Top of head. Visualize violet/white energy. Affirmation: 'I am connected to divine consciousness.' (5 minutes)",
        "Integration: Feel all chakras aligned and glowing. Sit in stillness (4 minutes). Slowly return awareness to body and room."
      ],
      "safety_notes": "May bring up emotional releases - this is normal. Stay hydrated. If overwhelming, open eyes and ground yourself. Not recommended for those with serious mental health conditions without professional guidance.",
      "optional_shloka_id": "shl011",
      "avoid_common_mistake": "Don't rush through chakras. Each needs time for awareness and activation. Also, this is advanced practice - beginners should start with simpler meditation.",
      "related_contexts": ["Energy healing", "Spiritual practice", "Holistic wellness"]
    },
    {
      "id": "well007",
      "name": "Walking Meditation in Nature",
      "routine_type": "Meditation",
      "category": "mindful_movement",
      "recommended_persona_id": "pers001",
      "quick_version": "20-min mindful walking meditation connecting with nature.",
      "target_mood": "Mindfulness, nature connection, gentle energy",
      "duration_minutes": 20,
      "difficulty": "Beginner",
      "effort_level": "Very Low - gentle movement",
      "steps": [
        "Find quiet natural path - garden, park, forest trail, or beach.",
        "Stand still for 1 minute. Feel feet on ground. Take 5 deep breaths.",
        "Begin walking very slowly. Be aware of lifting foot, moving it, placing it down.",
        "Notice sensations: texture of ground, temperature, sounds of nature, breeze on skin.",
        "If mind wanders, gently return attention to walking and sensations.",
        "Walk for 15 minutes maintaining awareness. No destination - the walk itself is practice.",
        "Pause halfway and stand still for 1 minute. Close eyes. Listen to nature sounds.",
        "Continue walking, perhaps incorporating silent gratitude for nature with each step.",
        "End by standing still for 2 minutes. Feel body, breath, connection with earth."
      ],
      "safety_notes": "Choose safe, quiet location. Watch footing on uneven ground. Can be practiced anywhere - even in cities. No special equipment needed. Weather appropriate clothing.",
      "optional_shloka_id": "shl015",
      "avoid_common_mistake": "This isn't exercise - it's meditation. Go slower than you think necessary. Focus is on awareness, not distance or speed.",
      "related_contexts": ["Nature connection", "Mindfulness", "Gentle exercise"],
      "related_sites": ["sp017", "sp022"]
    },
    {
      "id": "well008",
      "name": "Yoga Nidra Deep Relaxation",
      "routine_type": "Meditation",
      "category": "deep_relaxation",
      "recommended_persona_id": "pers002",
      "quick_version": "30-min yogic sleep practice for profound rest and restoration.",
      "target_mood": "Deep relaxation, restoration, stress release",
      "duration_minutes": 30,
      "difficulty": "Beginner",
      "effort_level": "Very Low - lying down practice",
      "steps": [
        "Lie in Shavasana (corpse pose) on comfortable surface. Use blanket if needed.",
        "Set intention (Sankalpa) - short positive affirmation repeated 3 times mentally.",
        "Bring awareness to body. Feel each body part from toes to head becoming heavy and relaxed (5 minutes).",
        "Awareness of breath. Count breaths backward from 27 to 1. If lose count, start again (5 minutes).",
        "Rotation of consciousness through body parts. Mentally touch each part as named (8 minutes).",
        "Awareness of opposite sensations: heaviness/lightness, hot/cold, pain/pleasure (5 minutes).",
        "Visualization: Imagine peaceful place - beach, mountain, forest. Engage all senses (5 minutes).",
        "Repeat Sankalpa 3 times with full conviction and feeling.",
        "Slowly return awareness to breath, body, room. Wiggle fingers and toes. Gently stretch. Come to sitting slowly."
      ],
      "safety_notes": "Practice lying down. Normal to fall asleep - that's okay. If using for sleep, skip final awakening steps. Best practiced midday or evening. Not recommended right after heavy meal.",
      "optional_shloka_id": "shl019",
      "avoid_common_mistake": "Goal is to remain aware, not sleep. If you fall asleep, practice at different time when more alert. 30 minutes Yoga Nidra equals 2-3 hours deep sleep in restorative power.",
      "related_contexts": ["Deep relaxation", "Sleep aid", "Stress recovery", "Jet lag"]
    }
  ]
}
